Revit 2026 API

# SpeckleSpeckleSize Property

---

The property labeled "Size" from the "Speckle" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SpeckleSize { get; }
```
```vb
Public Shared ReadOnly Property SpeckleSize As String
	Get
```
```cpp
public:
static property String^ SpeckleSize {
	String^ get ();
}
```
```fsharp
static member SpeckleSize : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 100".

#### Reference

Speckle Class

Autodesk.Revit.DB.Visual Namespace